Repository: AurunChill/AstroBot
Catalog: src/*_bot/locales/*/LC_MESSAGES/messages.po
Languages: ru

# menu_msg
source: <b>📋 Select a menu option!</b>
ru: <b>📋 Выберите опцию меню!</b>

# horoscope_btn
source: 🔮 Horoscope
ru: 🔮 Гороскоп

# event_btn
source: 📅 Events
ru: 📅 События

# profile_btn
source: 👤 Profile
ru: 👤 Профиль

# help_btn
source: ❓ Help
ru: ❓ Помощь

# decline_btn
source: ❌ Cancel
ru: ❌ Отмена

# declined_msg
source: <b>❌ Command canceled!</b> You can select another option or try again.
ru: <b>❌ Команда отменена!</b> Вы можете выбрать другую опцию или попробовать снова.

# freely_unavailable_msg
source: <b>Full version unavailable!</b> Change your account status by using the <i>/profile</i> command and selecting the option "Change status 👑"
ru: <b>Полная версия недоступна!</b> Измените статус аккаунта, воспользуйтесь командой <i>/profile</i> и выберите опцию "Изменить статус 👑"

# user_not_found_msg
source: <b>👀 User not found!</b> Please use the <i>/start</i> command to begin working with the bot.
ru: <b>👀 Пользователь не найден!</b> Пожалуйста, воспользуйтесь командой <i>/start</i> для начала работы с ботом.

# not_registered
source: <b>You are not registered!</b> Please use the <i>/register</i> command to create an account and continue.
ru: <b>Вы не зарегистрированы!</b> Пожалуйста, используйте команду <i>/register</i>, чтобы создать аккаунт и продолжить.

# wait_calc_msg
source: <b>Calculating! ⌛</b> Please wait, this may take some time...
ru: <b>Производим расчет! ⌛</b> Пожалуйста, подождите, это может занять некоторое время...

# start_msg
source: <b>Welcome to the world of astrology!</b> ✨ This bot will help you calculate your horoscope and discover important dates and events that will happen in your life. Just provide your date, time, and place of birth, and we will perform an astrological calculation for you! <b>May the stars guide you!</b> 🌟
ru: <b>Добро пожаловать в мир астрологии!</b> ✨ Этот бот поможет вам рассчитать гороскоп и узнать важные даты и события, которые произойдут в вашей жизни. Просто укажите дату, время и место рождения, и мы произведем астрологический расчет для вас! <b>Пусть звезды ведут вас!</b> 🌟

# help_msg
source: <b>📋 Here is a list of available commands:</b> <i>/help</i> - see available commands <i>/lang</i> - change language <i>/profile</i> - edit profile data <i>/horoscope</i> - calculate daily or monthly energy <i>/events</i> - calculate events and their dates <i>/sub</i> - change account status <i>/menu</i> - return to the main menu <i>/admin</i> - get admin-panel link
ru: <b>📋 Вот список доступных команд:</b> <i>/help</i> - посмотреть доступные команды <i>/lang</i> - поменять язык <i>/profile</i> - редактировать данные профиля <i>/horoscope</i> - рассчитать энергию дня или месяца <i>/events</i> - рассчитать события и их даты <i>/sub</i> - изменить статус аккаунта <i>/menu</i> - вернуться в главное меню <i>/admin</i> - получить ссылку админ-панели

# lang_msg
source: <b>Select a language 🌐</b> Choose the language to communicate with the bot for further interactions.
ru: <b>Выберите язык 🌐</b> Выберите язык общения с ботом для дальнейшей работы.

# lang_changed_msg
source: <b>Language has been changed to English! 🇬🇧</b>
ru: <b>Язык изменен на русский! 🇷🇺</b>

# not_admin_msg
source: <b>You're not administrator!</b>
ru: <b>Вы не являетесь администратором!</b>

# admin_panel_msg
source: Admin panel 💻
ru: Панель админа 💻

# profile_title_msg
source: <b>Name:</b>
ru: <b>Имя:</b>

# profile_birth_msg
source: <b>Date and time of birth:</b>
ru: <b>Дата и время рождения:</b>

# profile_birth_location_msg
source: <b>Place of birth:</b>
ru: <b>Место рождения:</b>

# profile_location_msg
source: <b>Location:</b>
ru: <b>Местоположение:</b>

# location_not_found_msg
source: <i>Location not determined</i> Check your geolocation settings and try again.
ru: <i>Локация не определена</i> Проверьте настройки геолокации и попробуйте снова.

# location_error_msg
source: <i>Error determining location</i> Please try sending your location again.
ru: <i>Ошибка определения локации</i> Пожалуйста, попробуйте отправить локацию еще раз.

# max_profiles_msg
source: <b>❌ You have already created the maximum number of profiles (3) for one account!</b> You can delete one of the existing profiles before creating a new one.
ru: <b>❌ Вы уже создали максимальное количество профилей (3) на один аккаунт!</b> Вы можете удалить один из существующих профилей перед созданием нового.

# send_prof_name_msg
source: ✨ <b>Send the name</b> For example: <i>James Johnson</i>
ru: ✨ <b>Отправьте имя</b> Например: <i>Инокентий Аркадьевич</i>

# prof_name_err_msg
source: ⚠️ <b>Error!</b> Please try entering the name again!
ru: ⚠️ <b>Ошибка!</b> Попробуйте ввести имя еще раз!

# send_birth_date_msg
source: 🎉🎂 <b>Send your date of birth</b> For example: <i>20.12.2004</i>
ru: 🎉🎂 <b>Отправьте дату рождения</b> Например: <i>20.12.2004</i>

# birth_date_err_msg
source: ⚠️ <b>Error!</b> Please try entering your date of birth again in the correct format.
ru: ⚠️ <b>Ошибка!</b> Попробуйте ввести дату рождения еще раз, в правильном формате.

# send_birth_time_msg
source: 🕒 <b>Send your time of birth</b> For example: <i>00:23</i>. Default: <i>00:00</i>
ru: 🕒 <b>Отправьте время рождения</b> Например: <i>00:23</i>. По умолчанию: <i>00:00</i>

# birth_time_err_msg
source: ⚠️ <b>Error!</b> Please enter your time of birth again, ensuring that it is correct.
ru: ⚠️ <b>Ошибка!</b> Пожалуйста, введите время рождения снова, убедитесь, что оно корректное.

# send_birth_location_msg
source: 📍 <b>Send the name of the place of your birth. Example: USA, Chicago</b>
ru: 📍 <b>Отправьте название места вашего рождения. Например: Россия, г. Москва</b>

# birth_location_err_msg
source: ⚠️ <b>Error!</b> Please send the name of the place of your birth!.
ru: ⚠️ <b>Ошибка!</b> Пожалуйста, отправьте название места вашего рождения, чтобы мы могли правильно рассчитать ваш гороскоп.

# send_current_location_msg
source: 🌍 <b>Please send the geolocation of your current location</b>
ru: 🌍 <b>Пожалуйста, отправьте геолокацию вашего текущего расположения</b>

# current_location_err_msg
source: ⚠️ <b>Error!</b> Please send the geolocation of your current location so we can update the information.
ru: ⚠️ <b>Ошибка!</b> Пожалуйста, отправьте геолокацию вашего текущего расположения, чтобы мы могли обновить информацию.

# new_profile_msg
source: 🎉 <b>New profile successfully created!</b> Use the <i>/profile</i> command
ru: 🎉 <b>Новый профиль успешно создан!</b> Воспользуйтесь командой <i>/profile</i>

# error_setting_current_profile_msg
source: <b>Error creating profile! ❌ </b> Please try again!
ru: <b>Ошибка создания профиля! ❌ </b> Попробуйте еще раз!

# add_profile_msg
source: ✨ <b>New profile added!</b> Use the <i>/profile</i> command
ru: ✨ <b>Новый профиль добавлен!</b> Воспользуйтесь командой <i>/profile</i>

# share_location_btn
source: 📍 Share location
ru: 📍 Поделиться местоположением

# change_profile_btn
source: 🔄 Change profile
ru: 🔄 Поменять профиль

# change_data_btn
source: 🔧 Change data
ru: 🔧 Изменить данные

# delete_profile_btn
source: 🗑️ Delete profile
ru: 🗑️ Удалить профиль

# change_subscription_btn
source: 👑 Change status
ru: 👑 Изменить статус

# choose_profile_msg
source: 🔍 Choose an <b>existing</b> profile or create a <b>new</b> one
ru: 🔍 Выберите <b>существующий</b> профиль или создайте <b>новый</b>

# add_profile_btn
source: ➕ Add profile
ru: ➕ Добавить профиль

# profile_changed_msg
source: <b>Profile successfully changed! ✅ </b> You can continue using the <i>/profile</i> command to manage your profile.
ru: <b>Профиль успешно изменен! ✅ </b> Вы можете продолжать использовать команду <i>/profile</i> для управления вашим профилем.

# profile_deleted_changed_msg
source: <b>Profile deleted! 🗑️ </b> Another profile has become the primary one. You can edit it via the <i>/profile</i> command.
ru: <b>Профиль удален! 🗑️ </b> Другой профиль стал основным. Вы можете редактировать его через команду <i>/profile</i>.

# profile_deleted_new_msg
source: <b>Profile deleted! 🗑️ </b> Please create a new profile using the <i>/register</i> command.
ru: <b>Профиль удален! 🗑️ </b> Пожалуйста, создайте новый профиль с помощью команды <i>/register</i>.

# prefer_to_change_msg
source: What would you like to change in your profile? 🔧
ru: Что вы хотите изменить в своем профиле? 🔧

# profile_change_title_btn
source: ✏️ Name
ru: ✏️ Имя

# profile_change_birth_date_btn
source: 🎂 Date of birth
ru: 🎂 Дата рождения

# profile_change_birth_time_btn
source: 🕒 Time of birth
ru: 🕒 Время рождения

# profile_change_birth_location_btn
source: 📍 Place of birth
ru: 📍 Место рождения

# profile_change_location_btn
source: 📌 Location
ru: 📌 Местоположение

# title_changed_msg
source: <b>Name changed! ✏️ </b> Your profile will now be displayed under the updated name.
ru: <b>Имя изменено! ✏️ </b> Теперь ваш профиль будет отображаться под обновленным именем.

# birth_date_changed_msg
source: <b>Date of birth changed! 🎂 </b> Please note that this may affect your astrological calculations.
ru: <b>Дата рождения изменена! 🎂 </b> Учтите, что это может повлиять на ваши астрологические расчеты.

# birth_time_changed_msg
source: <b>Time of birth changed! 🕒</b> Please ensure that the new time is correctly set.
ru: <b>Время рождения изменено! 🕒</b> Пожалуйста, убедитесь, что новое время задано корректно.

# birth_location_changed_msg
source: <b>Place of birth changed! 📍</b> Your astrological calculations will be updated with the new place.
ru: <b>Место рождения изменено! 📍</b> Ваши астрологические расчеты будут обновлены с учетом нового места.

# current_location_changed_msg
source: <b>Location changed! 📌</b> This will help us provide more relevant recommendations.
ru: <b>Местоположение изменено! 📌</b> Это поможет нам предоставить более актуальные рекомендации.

# create_horoscope_option_msg
source: <b>Select a period for horoscope calculation! 🔮 </b> Choose the desired option for the forecast.
ru: <b>Выберите период для расчета гороскопа! 🔮 </b> Выберите нужный вариант для получения прогноза.

# today_btn
source: 📅 Today
ru: 📅 Сегодня

# month_btn
source: 📆 Month
ru: 📆 Месяц

# date_btn
source: 📅 Date
ru: 📅 Дату

# mail_btn
source: 📧 Subscription
ru: 📧 Рассылка

# ask_date_msg
source: 📅 Enter the date. Example: <i>20.12.2024</i>
ru: 📅 Введите дату. Пример: <i>20.12.2024</i>

# date_error_msg
source: <b>Error! ⚠️</b> Please enter the date again in the correct format so that we can calculate the horoscope.
ru: <b>Ошибка! ⚠️</b> Пожалуйста, введите дату еще раз в правильном формате, чтобы мы могли рассчитать гороскоп.

# mail_subscribed_msg
source: b> Dear subscribers! 🌟</b> Thank you for joining our horoscope channel! We are glad to welcome you to our society of star seekers. Every morning at <i>7:00</i> You will receive fresh forecasts that will help you make your day brighter and more successful! <b>May the stars lead you to new heights! ✨</b> With love, <i>{}</i>
ru: <b>🌟 Дорогие подписчики! 🌟</b> Спасибо, что присоединились к нашему гороскоп-каналу! Мы рады приветствовать Вас в нашем обществе звездных искателей. Каждое утро в <i>7:00</i> Вы будете получать свежие прогнозы, которые помогут Вам сделать Ваш день ярче и успешнее! <b>Пусть звезды ведут Вас к новым вершинам! ✨</b> С любовью, <i>{}</i>

# mail_unsubscribe_msg
source: <b>You are unsubscribed from the daily newsletter! ❌</b> You can subscribe again to receive daily forecasts at <i>7:00 AM MSK</i>!
ru: <b>Вы отписаны от ежедневной рассылки! ❌</b> Вы можете подписаться снова, чтобы получать ежедневные прогнозы в <i>7:00 по МСК</i>!

# mail_subscribe_btn
source: Subscribe ✅
ru: Подписаться ✅

# mail_unsubscribe_btn
source: Unsubscribe ❌
ru: Отписаться ❌

# wanna_date_msg
source: 📅 Want to know the date of events?
ru: 📅 Хочешь узнать дату событий?

# event_study_btn
source: 📚 Study
ru: 📚 Учеба

# event_mood_btn
source: 😊 Mood
ru: 😊 Настроение

# event_love_btn
source: ❤️ Love
ru: ❤️ Любовь

# event_income_btn
source: 💰 Income
ru: 💰 Доходы

# event_success_btn
source: 🏆 Success
ru: 🏆 Успехи

# choose_duration_msg
source: ⌛ Choose a time span:
ru: ⌛ Выберите промежуток времени:

# event_duration_45_btn
source: 📆 45 days
ru: 📆 45 дней

# event_duration_90_btn
source: 📆 90 days
ru: 📆 90 дней

# event_duration_180_btn
source: 📆 180 days
ru: 📆 180 дней

# event_duration_365_btn
source: 📆 365 days
ru: 📆 365 дней

# subscribed_forever_msg
source: <b>You are already subscribed forever!</b> 🎉
ru: <b>Вы уже подписаны навсегда!</b> 🎉

# subscirbed_montly_msg
source: <b>You are already subscribed for this month!🎉</b>
ru: <b>Вы уже подписаны на месяц!🎉</b>

# subscription_expiration_msg
source: <b>Subscription paid for one month!</b> ⏳ Expiration date: <i>{}</i> Don't forget to renew to avoid losing access!
ru: <b>Подписка оплачена на месяц!</b> ⏳ Срок истечения: <i>{}</i> Не забудьте продлить, чтобы не потерять доступ!

# no_subscription_msg
source: <b>You are not subscribed! ❌</b> Subscribing grants access to <b>full</b> calculations (horoscope, events) and allows you to receive forecasts for longer periods in the "Events" section. Choose an option to subscribe and enjoy all the benefits! 💳
ru: <b>Вы не подписаны! ❌</b> Подписка открывает доступ к <b>полным</b> расчетам (гороскоп, события) и позволяет получать прогнозы на более продолжительные сроки в разделе "События". Выберите опцию для оформления подписки и наслаждайтесь всеми преимуществами! 💳

# sub_month_btn
source: 🗓️ Month
ru: 🗓️ Месяц

# sub_forever_btn
source: ♾️ Forever
ru: ♾️ Навсегда

# sub_month_msg
source: 📅 One-month subscription
ru: 📅 Подписка на месяц

# sub_forever_msg
source: ♾️ Forever subscription
ru: ♾️ Подписка навсегда

# sub_description_msg
source: The subscription opens access to the full calculation and adds the "180 days" and "365 days" selection options in the "📅 Events" category
ru: Подписка открывает доступ к полным расчетам и добавляет опции выбора "180 дней" и "365 дней" в категории "📅 События"

# sub_success_msg
source: <b>Subscription successfully processed! 🎉</b> Now you have access to all full calculations. Enjoy your use! 💖
ru: <b>Подписка оформлена! 🎉</b> Теперь у вас есть доступ ко всем полным расчетам. Пользуйтесь на здоровье! 💖

# subscription_expired_msg
source: <b>Subscription expired! ⏳</b> You can renew your subscription <i>/sub</i>
ru: <b>Истёк срок подписки! ⏳</b> Вы можете продлить подписку <i>/sub</i>
